yasserabdoulaye92/Projet_DEEP/drivers/bsp/SD/stm32g4_sd.c
/* Private define ------------------------------------------------------------*/
#define SD_DUMMY_BYTE				0xFF
#define SD_NO_RESPONSE_EXPECTED		0x80

#define SD_MAX_FRAME_LENGTH			17    /* Lenght = 16 + 1 */
#define SD_CMD_LENGTH               6

#define SD_MAX_TRY					100    /* Number of try */

#define SD_CSD_STRUCT_V1			0x2    /* CSD struct version V1 */
#define SD_CSD_STRUCT_V2			0x1    /* CSD struct version V2 */

/**
  * @brief  SD Control Interface pins
  */
#define SD_CS_PIN					GPIO_PIN_0
#define SD_CS_GPIO_PORT				GPIOB
#define SD_CS_GPIO_CLK_ENABLE()		__HAL_RCC_GPIOB_CLK_ENABLE()
#define SD_CS_GPIO_CLK_DISABLE()	__HAL_RCC_GPIOB_CLK_DISABLE()
#define SD_SPI						SPI1

/**
  * @brief  SD Control Lines management
  */
#define SD_CS_LOW()			HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_RESET)
#define SD_CS_HIGH()		HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_SET)

/**
  * @brief  SD ansewer format
  */
typedef enum {
 SD_ANSWER_R1_EXPECTED,
 SD_ANSWER_R1B_EXPECTED,
 SD_ANSWER_R2_EXPECTED,
 SD_ANSWER_R3_EXPECTED,
 SD_ANSWER_R4R5_EXPECTED,
 SD_ANSWER_R7_EXPECTED,
}SD_Answer_type;

/**
  * @brief  Start Data tokens:
  *         Tokens (necessary because at nop/idle (and CS active) only 0xff is
  *         on the data/command line)
  */
#define SD_TOKEN_START_DATA_SINGLE_BLOCK_READ		0xFE  /* Data token start byte, Start Single Block Read */
#define SD_TOKEN_START_DATA_MULTIPLE_BLOCK_READ		0xFE  /* Data token start byte, Start Multiple Block Read */
#define SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE		0xFE  /* Data token start byte, Start Single Block Write */
#define SD_TOKEN_START_DATA_MULTIPLE_BLOCK_WRITE	0xFD  /* Data token start byte, Start Multiple Block Write */
#define SD_TOKEN_STOP_DATA_MULTIPLE_BLOCK_WRITE		0xFD  /* Data toke stop byte, Stop Multiple Block Write */

/**
  * @brief  Commands: CMDxx = CMD-number | 0x40
  */
#define SD_CMD_GO_IDLE_STATE			0   /* CMD0 = 0x40  */
#define SD_CMD_SEND_OP_COND				1   /* CMD1 = 0x41  */
#define SD_CMD_SEND_IF_COND				8   /* CMD8 = 0x48  */
#define SD_CMD_SEND_CSD					9   /* CMD9 = 0x49  */
#define SD_CMD_SEND_CID					10  /* CMD10 = 0x4A */
#define SD_CMD_STOP_TRANSMISSION		12  /* CMD12 = 0x4C */
#define SD_CMD_SEND_STATUS				13  /* CMD13 = 0x4D */
#define SD_CMD_SET_BLOCKLEN				16  /* CMD16 = 0x50 */
#define SD_CMD_READ_SINGLE_BLOCK		17  /* CMD17 = 0x51 */
#define SD_CMD_READ_MULT_BLOCK			18  /* CMD18 = 0x52 */
#define SD_CMD_SET_BLOCK_COUNT			23  /* CMD23 = 0x57 */
#define SD_CMD_WRITE_SINGLE_BLOCK		24  /* CMD24 = 0x58 */
#define SD_CMD_WRITE_MULT_BLOCK			25  /* CMD25 = 0x59 */
#define SD_CMD_PROG_CSD					27  /* CMD27 = 0x5B */
#define SD_CMD_SET_WRITE_PROT			28  /* CMD28 = 0x5C */
#define SD_CMD_CLR_WRITE_PROT			29  /* CMD29 = 0x5D */
#define SD_CMD_SEND_WRITE_PROT			30  /* CMD30 = 0x5E */
#define SD_CMD_SD_ERASE_GRP_START		32  /* CMD32 = 0x60 */
#define SD_CMD_SD_ERASE_GRP_END			33  /* CMD33 = 0x61 */
#define SD_CMD_UNTAG_SECTOR				34  /* CMD34 = 0x62 */
#define SD_CMD_ERASE_GRP_START			35  /* CMD35 = 0x63 */
#define SD_CMD_ERASE_GRP_END			36  /* CMD36 = 0x64 */
#define SD_CMD_UNTAG_ERASE_GROUP		37  /* CMD37 = 0x65 */
#define SD_CMD_ERASE					38  /* CMD38 = 0x66 */
#define SD_CMD_SD_APP_OP_COND			41  /* CMD41 = 0x69 */
#define SD_CMD_APP_CMD					55  /* CMD55 = 0x77 */
#define SD_CMD_READ_OCR					58  /* CMD55 = 0x79 */

/**
  * @brief  SD reponses and error flags
  */
typedef enum
{
/* R1 answer value */
  SD_R1_NO_ERROR            = (0x00),
  SD_R1_IN_IDLE_STATE       = (0x01),
  SD_R1_ERASE_RESET         = (0x02),
  SD_R1_ILLEGAL_COMMAND     = (0x04),
  SD_R1_COM_CRC_ERROR       = (0x08),
  SD_R1_ERASE_SEQUENCE_ERROR= (0x10),
  SD_R1_ADDRESS_ERROR       = (0x20),
  SD_R1_PARAMETER_ERROR     = (0x40),

/* R2 answer value */
  SD_R2_NO_ERROR            = 0x00,
  SD_R2_CARD_LOCKED         = 0x01,
  SD_R2_LOCKUNLOCK_ERROR    = 0x02,
  SD_R2_ERROR               = 0x04,
  SD_R2_CC_ERROR            = 0x08,
  SD_R2_CARD_ECC_FAILED     = 0x10,
  SD_R2_WP_VIOLATION        = 0x20,
  SD_R2_ERASE_PARAM         = 0x40,
  SD_R2_OUTOFRANGE          = 0x80,

/**
  * @brief  Data response error
  */
  SD_DATA_OK                = (0x05),
  SD_DATA_CRC_ERROR         = (0x0B),
  SD_DATA_WRITE_ERROR       = (0x0D),
  SD_DATA_OTHER_ERROR       = (0xFF)
} SD_Error;


/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

__IO uint8_t SdStatus = SD_NOT_PRESENT;

/* flag_SDHC :
      0 :  Standard capacity
      1 : High capacity
*/
uint16_t flag_SDHC = 0;


/* Private function prototypes -----------------------------------------------*/
static void SD_IO_Init(void);
static HAL_StatusTypeDef SD_IO_WriteCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Response);
static HAL_StatusTypeDef SD_IO_WaitResponse(uint8_t Response);
static void SD_IO_WriteDummy(void);
static uint8_t SD_IO_WriteByte(uint8_t Data);
static uint8_t SD_IO_ReadByte(void);
static uint8_t SD_IO_WriteReadByte(uint8_t Data);
static uint8_t SD_GetCIDRegister(SD_CID* Cid);
static uint8_t SD_GetCSDRegister(SD_CSD* Csd);
static uint8_t SD_GetDataResponse(void);
static uint8_t SD_GoIdleState(void);
static SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer);
static uint8_t SD_WaitData(uint8_t data);
static uint8_t SD_ReadData(void);


/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for
  *         data transfer).
  * @retval None
  */
static void SD_IO_Init(void)
{
	GPIO_InitTypeDef  gpioinitstruct = {0};
	uint8_t counter = 0;

	/* SD_CS_GPIO Periph clock enable */
	SD_CS_GPIO_CLK_ENABLE();

	/* Configure SD_CS_PIN pin: SD Card CS pin */
	gpioinitstruct.Pin    = SD_CS_PIN;
	gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
	gpioinitstruct.Pull   = GPIO_PULLUP;
	gpioinitstruct.Speed  = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(SD_CS_GPIO_PORT, &gpioinitstruct);

	/*------------Put SD in SPI mode--------------*/
	/* SD SPI Config */
	BSP_SPI_Init(SD_SPI, FULL_DUPLEX, MASTER, SPI_BAUDRATEPRESCALER_256); //Le choix à été fait de mettre aussi lent au moment du débogage

	/* SD chip select high */
	SD_CS_HIGH();

	/* Send dummy byte 0xFF, 10 times with CS high */
	/* Rise CS and MOSI for 80 clocks cycles */
	/*
	BSP_GPIO_pin_config(GPIOA, GPIO_PIN_5, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, GPIO_NO_AF);
	BSP_GPIO_pin_config(GPIOA, GPIO_PIN_7, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, GPIO_NO_AF);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, 1); //Les codes en commentaires ici permettent l'envoyer manuellement les dummy bytes pour ralentir un max
	*/
	for (counter = 0; counter <= 9/* *8 */; counter++)
	{
		/* Send dummy byte 0xFF */
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		/*
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, 1);
		Delay_us(10);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, 0);
		Delay_us(10);
		*/
	}
	/*
	BSP_GPIO_pin_config(GPIOA, GPIO_PIN_5, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, GPIO_AF5_SPI1);
	BSP_GPIO_pin_config(GPIOA, GPIO_PIN_7, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_HIGH, GPIO_AF5_SPI1);
	*/
}

/**
  * @brief  Set the SD_CS pin.
  * @param  val: pin value.
  */
static void SD_IO_CSState(uint8_t val)
{
	if(val == 1)
	{
		SD_CS_HIGH();
	}
	else
	{
		SD_CS_LOW();
	}
}

/**
  * @brief  Write a byte on the SD.
  * @param  DataIn: byte to send.
  * @param  DataOut: byte to read
  * @param  DataLength: length of data
  */
static void SD_IO_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength)
{
	/* Send the byte */
	uint16_t i;
	for(i=0;i<DataLength;i++)
		DataOut[i] = (uint8_t)(BSP_SPI_WriteRead(SD_SPI, DataIn[i]));
}

/**
  * @brief  Writes a byte on the SD.
  * @param  Data: byte to send.
  * @retval None
  */
static uint8_t SD_IO_WriteByte(uint8_t Data)
{
	/* Send the byte */
	return BSP_SPI_WriteRead(SD_SPI, Data) & 0xFF;
}


static uint8_t SD_IO_WriteReadByte(uint8_t Data)
{
	/* Send the byte */
	uint8_t ret;
	SD_IO_WriteReadData(&Data, &ret, 1);
	return ret;
}

/**
  * @brief  Reads a byte from the SD.
  * @retval The received byte.
  */
static uint8_t SD_IO_ReadByte(void)
{
	uint8_t data = 0;

	/* Get the received data */
	data = BSP_SPI_WriteRead(SD_SPI, (uint8_t)0xFFFFFFFF);

	/* Return the shifted data */
	return data;
}

/**
  * @brief  Sends 5 bytes command to the SD card and get response
  * @param  Cmd: The user expected command to send to SD card.
  * @param  Arg: The command argument.
  * @param  Crc: The CRC.
  * @param  Response: Expected response from the SD card
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef SD_IO_WriteCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t response)
{
	uint32_t counter = 0x00;
	uint8_t frame[6] = {0};

	/* Prepare Frame to send */
	frame[0] = (Cmd | 0x40);         /* Construct byte 1 */
	frame[1] = (uint8_t)(Arg >> 24); /* Construct byte 2 */
	frame[2] = (uint8_t)(Arg >> 16); /* Construct byte 3 */
	frame[3] = (uint8_t)(Arg >> 8);  /* Construct byte 4 */
	frame[4] = (uint8_t)(Arg);       /* Construct byte 5 */
	frame[5] = (Crc);                /* Construct byte 6 */

	/* SD chip select low */
	SD_CS_LOW();

	/* Send Frame */
	for (counter = 0; counter < 6; counter++)
	{
		SD_IO_WriteByte(frame[counter]); /* Send the Cmd bytes */
	}

	if(response != SD_NO_RESPONSE_EXPECTED)
	{
		return SD_IO_WaitResponse(response);
	}

	return HAL_OK;
}

/**
  * @brief  Waits response from the SD card
  * @param  Response: Expected response from the SD card
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef SD_IO_WaitResponse(uint8_t Response)
{
	uint32_t timeout = 0xFFFF;

