yasserabdoulaye92/Projet_DEEP/drivers/bsp/SD/stm32g4_sd.c
		/* Send dummy byte for NWR timing : one byte between CMDWRITE and TOKEN */
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		/* Send the data token to signify the start of the data */
		SD_IO_WriteByte(SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE);

		/* Write the block data to SD */
		SD_IO_WriteReadData((uint8_t*)pData + offset, ptr, BlockSize);

		/* Set next write address */
		offset += BlockSize;

		/* Put CRC bytes (not really needed by us, but required by SD) */
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		/* Read data response */
		if (SD_GetDataResponse() != SD_DATA_OK)
		{
			/* Set response value to failure */
			goto error;
		}

		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);
	}
	retr = BSP_SD_OK;

	error :
	if(ptr != NULL) free(ptr);
	/* Send dummy byte: 8 Clock pulses of delay */
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	/* Return the reponse */
	return retr;
}

/**
  * @brief  Erases the specified memory area of the given SD card.
  * @param  StartAddr: Start byte address
  * @param  EndAddr: End byte address
  * @retval SD status
  */
uint8_t BSP_SD_Erase(uint32_t StartAddr, uint32_t EndAddr)
{
	uint8_t retr = BSP_SD_ERROR;
	SD_CmdAnswer_typedef response;

	/* Send CMD32 (Erase group start) and check if the SD acknowledged the erase command: R1 response (0x00: no errors) */
	response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_START, StartAddr, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (response.r1 == SD_R1_NO_ERROR)
	{
		/* Send CMD33 (Erase group end) and Check if the SD acknowledged the erase command: R1 response (0x00: no errors) */
		response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_END, EndAddr, 0xFF, SD_ANSWER_R1_EXPECTED);
		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		if (response.r1 == SD_R1_NO_ERROR)
		{
			/* Send CMD38 (Erase) and Check if the SD acknowledged the erase command: R1 response (0x00: no errors) */
			response = SD_SendCmd(SD_CMD_ERASE, 0, 0xFF, SD_ANSWER_R1B_EXPECTED);
			if (response.r1 == SD_R1_NO_ERROR)
			{
				retr = BSP_SD_OK;
			}
			SD_IO_CSState(1);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		}
	}

	/* Return the reponse */
	return retr;
}

/**
  * @brief  Returns the SD status.
  * @param  None
  * @retval The SD status.
  */
uint8_t BSP_SD_GetStatus(void)
{
	SD_CmdAnswer_typedef retr;

	/* Send CMD13 (SD_SEND_STATUS) to get SD status */
	retr = SD_SendCmd(SD_CMD_SEND_STATUS, 0, 0xFF, SD_ANSWER_R2_EXPECTED);
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	/* Find SD status according to card state */
	if(( retr.r1 == SD_R1_NO_ERROR) && ( retr.r2 == SD_R2_NO_ERROR))
	{
		return BSP_SD_OK;
	}

	return BSP_SD_ERROR;
}

/**
  * @brief  Reads the SD card SCD register.
  *         Reading the contents of the CSD register in SPI mode is a simple
  *         read-block transaction.
  * @param  Csd: pointer on an SCD register structure
  * @retval SD status
  */
uint8_t SD_GetCSDRegister(SD_CSD* Csd)
{
	uint16_t counter = 0;
	uint8_t CSD_Tab[16];
	uint8_t retr = BSP_SD_ERROR;
	SD_CmdAnswer_typedef response;

	/* Send CMD9 (CSD register) or CMD10(CSD register) and Wait for response in the R1 format (0x00 is no errors) */
	response = SD_SendCmd(SD_CMD_SEND_CSD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
	if(response.r1 == SD_R1_NO_ERROR)
	{
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK)
		{
			for (counter = 0; counter < 16; counter++)
			{
				/* Store CSD register value on CSD_Tab */
				CSD_Tab[counter] = SD_IO_WriteByte(SD_DUMMY_BYTE);
			}

			/* Get CRC bytes (not really needed by us, but required by SD) */
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			/*************************************************************************
			CSD header decoding
			*************************************************************************/

			/* Byte 0 */
			Csd->CSDStruct = (CSD_Tab[0] & 0xC0) >> 6;
			Csd->Reserved1 =  CSD_Tab[0] & 0x3F;

			/* Byte 1 */
			Csd->TAAC = CSD_Tab[1];

			/* Byte 2 */
			Csd->NSAC = CSD_Tab[2];

			/* Byte 3 */
			Csd->MaxBusClkFrec = CSD_Tab[3];

			/* Byte 4/5 */
			Csd->CardComdClasses = (uint16_t)((CSD_Tab[4] << 4) | ((CSD_Tab[5] & 0xF0) >> 4));
			Csd->RdBlockLen = (uint8_t)(CSD_Tab[5] & 0x0F);

			/* Byte 6 */
			Csd->PartBlockRead   = (uint8_t)((CSD_Tab[6] & 0x80) >> 7);
			Csd->WrBlockMisalign = (uint8_t)((CSD_Tab[6] & 0x40) >> 6);
			Csd->RdBlockMisalign = (uint8_t)((CSD_Tab[6] & 0x20) >> 5);
			Csd->DSRImpl         = (uint8_t)((CSD_Tab[6] & 0x10) >> 4);

			/*************************************************************************
			CSD v1/v2 decoding
			*************************************************************************/

			if(flag_SDHC == 0)
			{
				Csd->version.v1.Reserved1 = ((CSD_Tab[6] & 0x0C) >> 2);

				Csd->version.v1.DeviceSize =  ((CSD_Tab[6] & 0x03) << 10)
									|  (CSD_Tab[7] << 2)
									| ((CSD_Tab[8] & 0xC0) >> 6);
				Csd->version.v1.MaxRdCurrentVDDMin = (CSD_Tab[8] & 0x38) >> 3;
				Csd->version.v1.MaxRdCurrentVDDMax = (CSD_Tab[8] & 0x07);
				Csd->version.v1.MaxWrCurrentVDDMin = (CSD_Tab[9] & 0xE0) >> 5;
				Csd->version.v1.MaxWrCurrentVDDMax = (CSD_Tab[9] & 0x1C) >> 2;
				Csd->version.v1.DeviceSizeMul = ((CSD_Tab[9] & 0x03) << 1)|((CSD_Tab[10] & 0x80) >> 7);
			}
			else
			{
				Csd->version.v2.Reserved1 = ((CSD_Tab[6] & 0x0F) << 2) | ((CSD_Tab[7] & 0xC0) >> 6);
				Csd->version.v2.DeviceSize= ((CSD_Tab[7] & 0x3F) << 16) | (CSD_Tab[8] << 8) | CSD_Tab[9];
				Csd->version.v2.Reserved2 = ((CSD_Tab[10] & 0x80) >> 8);
			}

			Csd->EraseSingleBlockEnable = (CSD_Tab[10] & 0x40) >> 6;
			Csd->EraseSectorSize   = ((CSD_Tab[10] & 0x3F) << 1)
						  |((CSD_Tab[11] & 0x80) >> 7);
			Csd->WrProtectGrSize   = (CSD_Tab[11] & 0x7F);
			Csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80) >> 7;
			Csd->Reserved2         = (CSD_Tab[12] & 0x60) >> 5;
			Csd->WrSpeedFact       = (CSD_Tab[12] & 0x1C) >> 2;
			Csd->MaxWrBlockLen     = ((CSD_Tab[12] & 0x03) << 2)
						  |((CSD_Tab[13] & 0xC0) >> 6);
			Csd->WriteBlockPartial = (CSD_Tab[13] & 0x20) >> 5;
			Csd->Reserved3         = (CSD_Tab[13] & 0x1F);
			Csd->FileFormatGrouop  = (CSD_Tab[14] & 0x80) >> 7;
			Csd->CopyFlag          = (CSD_Tab[14] & 0x40) >> 6;
			Csd->PermWrProtect     = (CSD_Tab[14] & 0x20) >> 5;
			Csd->TempWrProtect     = (CSD_Tab[14] & 0x10) >> 4;
			Csd->FileFormat        = (CSD_Tab[14] & 0x0C) >> 2;
			Csd->Reserved4         = (CSD_Tab[14] & 0x03);
			Csd->crc               = (CSD_Tab[15] & 0xFE) >> 1;
			Csd->Reserved5         = (CSD_Tab[15] & 0x01);

			retr = BSP_SD_OK;
		}
	}

	/* Send dummy byte: 8 Clock pulses of delay */
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	/* Return the reponse */
	return retr;
}

/**
  * @brief  Reads the SD card CID register.
  *         Reading the contents of the CID register in SPI mode is a simple
  *         read-block transaction.
  * @param  Cid: pointer on an CID register structure
  * @retval SD status
  */
uint8_t SD_GetCIDRegister(SD_CID* Cid)
{
	uint32_t counter = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t CID_Tab[16];
	SD_CmdAnswer_typedef response;

