yasserabdoulaye92/Projet_DEEP/drivers/bsp/SD/stm32g4_sd.c
	return BSP_SD_OK;
}

/**
  * @brief  Waits a data until a value different from SD_DUMMY_BITE
  * @param  None
  * @retval the value read
  */
uint8_t SD_ReadData(void)
{
	uint8_t timeout = 0x08;
	uint8_t readvalue;

	/* Check if response is got or a timeout is happen */
	do {
		readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
		timeout--;
	}while ((readvalue == SD_DUMMY_BYTE) && timeout);

	/* Right response got */
	return readvalue;
}

/**
  * @brief  Waits a data from the SD card
  * @param  data : Expected data from the SD card
  * @retval BSP_SD_OK or BSP_SD_TIMEOUT
  */
uint8_t SD_WaitData(uint8_t data)
{
	uint16_t timeout = 0xFFFF;
	uint8_t readvalue;

	/* Check if response is got or a timeout is happen */

	do {
		readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
		timeout--;
	}while ((readvalue != data) && timeout);

	if (timeout == 0)
	{
		/* After time out */
		return BSP_SD_TIMEOUT;
	}

	/* Right response got */
	return BSP_SD_OK;
}





#define display		printf
const char * datas_to_write = "test_datas\n";
const char * path = "0:test.txt";
FATFS SDFatFs;


void verbose_fresult (FRESULT rc)
{
	const char *p;
	static const char str[] =
		"OK\0" "NOT_READY\0" "NO_FILE\0" "FR_NO_PATH\0" "INVALID_NAME\0" "INVALID_DRIVE\0"
		"DENIED\0" "EXIST\0" "RW_ERROR\0" "WRITE_PROTECTED\0" "NOT_ENABLED\0"
		"NO_FILESYSTEM\0" "INVALID_OBJECT\0" "MKFS_ABORTED\0";
	FRESULT i;

	for (p = str, i = 0; i != rc && *p; i++) {
		while(*p++);
	}
	debug_printf("rc=%u FR_%s\n", (UINT)rc, p);
}


//Fonction pour tester la librairie d'acces a la carte SD ou a une cle USB...
running_t BSP_SD_demo_state_machine(bool ask_for_finish)
{
	typedef enum
	{
		INIT = 0,
		MOUNT,
		WRITE_TEST_FILE,
		READ_TEST_FILE,
		DELETE_TEST_FILE,
		END_WITH_ERROR,
		IDLE
	}state_e;

	static state_e state = INIT;
	FRESULT res = FR_OK;
	static FIL file;
	running_t ret;
	ret = IN_PROGRESS;

	switch(state)
	{
		case INIT:

			if(BSP_SD_Init() == MSD_OK)///*disk_initialize(PD_SD) == 0*/)
			{
				debug_printf("SD Card : module initialized\n");
				state = MOUNT;
			}
			else
			{
				debug_printf("Fail to initialize disk\n"); //le dernier test tombait tout le temps ici
				state = END_WITH_ERROR;
			}
			break;
		case MOUNT:{

			FATFS * fs;
			uint32_t p2;
			state = END_WITH_ERROR;	//On fait la supposition que Ã§a ne va pas marcher.... si tout se passe bien, on ira faire la suite.
			if(FATFS_LinkDriver(&SD_Driver, SD_path) != 0)
			{
				display("SD Card : NOT mounted\n");
			}
			else
			{
				res = f_mount(&SDFatFs, (TCHAR const*)SD_path, 0);
				if(res == FR_OK)
				{
					res = f_getfree("", (DWORD*)&p2, &fs);
					//res = f_mkfs((TCHAR const*)SDPath, 0, 0);

					if (res == FR_OK)
					{
						debug_printf("FAT type = %u (%s)\nBytes/Cluster = %lu\nNumber of FATs = %u\n"
									"Root DIR entries = %u\nSectors/FAT = %lu\nNumber of clusters = %lu\n"
									"FAT start (lba) = %lu\nDIR start (lba,clustor) = %lu\nData start (lba) = %lu\n\n",
									(WORD)fs->fs_type,
									(fs->fs_type==FS_FAT12) ? "FAT12" : (fs->fs_type==FS_FAT16) ? "FAT16" : "FAT32",
									(DWORD)fs->csize * 512, (WORD)fs->n_fats,
									fs->n_rootdir, fs->fsize, (DWORD)fs->n_fatent - 2,
									fs->fatbase, fs->dirbase, fs->database
						);
						display("SD Card : mounted\n");
						state = WRITE_TEST_FILE;
					}
				}
				if(res != FR_OK)
					verbose_fresult(res);
			}
			break;}
		case WRITE_TEST_FILE:{
			UINT nb_to_write;
			UINT nb_written;

			res = f_open(&file, path, FA_WRITE | FA_CREATE_ALWAYS | FA_OPEN_ALWAYS);
			if(res == FR_OK)
			{
				debug_printf("File %s opened\n",path);
				display("Testfile opened\n");
				nb_to_write = strlen((char *)datas_to_write);
				res = f_write(&file,datas_to_write,nb_to_write,&nb_written);
				if(res == FR_OK && nb_to_write == nb_written)
					debug_printf("datas wrote in file\n");
				else
					debug_printf("Fail to write datas in file\n");
				f_close(&file);
			}
			else
			{
				debug_printf("Fail to open file %s\n",path);
			}

			state = READ_TEST_FILE;
			break;}
		case READ_TEST_FILE:{
			#define READ_BUFFER_SIZE	32
			UINT nb_read = 0;
			uint8_t datas_read[READ_BUFFER_SIZE];
			res = f_open(&file, path, FA_READ);
			if(res == FR_OK)
			{
				res = f_read(&file,datas_read,READ_BUFFER_SIZE,&nb_read);
				datas_read[nb_read] = '\0';	//Pour utiliser strcmp...
				if(strcmp((char*)datas_read,(char*)datas_to_write) == 0)
					debug_printf("Correct data read\n");
				else
					debug_printf("Bad data read : %d datas : %s\n",nb_read,datas_read);
				f_close(&file);
			}
			state = DELETE_TEST_FILE;
			break;}
		case DELETE_TEST_FILE:
			res = f_unlink(path);
			if(res == FR_OK)
				debug_printf("Test File deleted : ok\n");
			else
				debug_printf("Error deleting test file\n");
			state = IDLE;
			break;

		case END_WITH_ERROR:
			debug_printf("SD Card : error\n");
			display("SD Card : ERROR\n");
			state = IDLE;
			break;
		case IDLE:
			if(ask_for_finish)
			{
				state = INIT;
				ret = END_OK;
			}
			break;
		default:
			break;
	}

	if(res != FR_OK)
		verbose_fresult(res);
	return ret;
}

#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
